import random


EIGHTBALL = [

    "🎱 Да.",
    "🎱 Нет.",
    "🎱 Определённо.",
    "🎱 Скорее всего.",
    "🎱 Возможно.",
    "🎱 Сомнительно.",
    "🎱 Даже не думай.",
    "🎱 Судьба решит."
]


TRUTH = [

    "Кто тебе нравится?",
    "Какой твой самый кринжовый поступок?",
    "Какой у тебя самый странный секрет?",
    "Кому ты доверяешь больше всего?",
    "Какой самый смешной случай с тобой происходил?"
]


DARE = [

    "Напиши сообщение только эмодзи.",
    "Сделай кому-нибудь комплимент.",
    "Напиши «Я легенда».",
    "Отправь случайный мем.",
    "Напиши сообщение без буквы А."
]


TASKS = [

    "Придумай себе новое прозвище.",
    "Напиши самый странный факт о себе.",
    "Назови любимую игру.",
    "Сделай кому-нибудь комплимент.",
    "Напиши первое слово, которое пришло в голову.",
    "Отправь три случайных эмодзи."
]


def ball():

    return random.choice(
        EIGHTBALL
    )


def truth():

    return (
        "🎭 ПРАВДА\n\n"
        + random.choice(TRUTH)
    )


def dare():

    return (
        "🔥 ДЕЙСТВИЕ\n\n"
        + random.choice(DARE)
    )


def task():

    return (
        "🎯 ЗАДАНИЕ\n\n"
        + random.choice(TASKS)
    )


def dice():

    return random.randint(
        1,
        6
    )


def coin():

    return random.choice(
        [
            "🪙 Орёл",
            "🪙 Решка"
        ]
    )


def nickname():

    a = [
        "Супер",
        "Безумный",
        "Космический",
        "Могучий",
        "Сигма",
        "Легендарный"
    ]

    b = [
        "Гусь",
        "Кабан",
        "Кот",
        "Бобёр",
        "Дракон",
        "Пельмень"
    ]

    return (
        random.choice(a)
        + " "
        + random.choice(b)
    )
